W7D3/wetransfer-310ec2/kenny_hufford/rails_olympics_production_A_skeleton/build_rails_project_pt2/BlogApp/app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    if @blog.save
---
INSERT INTO "blogs" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Day 3 - BEST DAY!"], ["body", "best day evar"], ["author_id", 46], ["created_at", "2019-11-26 17:33:56.091757"], ["updated_at", "2019-11-26 17:33:56.091757"]]

  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 72]]