W6D5/cats_99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(user_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "1944-12-12"], ["color", "black"], ["name", "jerry"], ["sex", "F"], ["created_at", "2019-11-22 22:53:54.540818"], ["updated_at", "2019-11-22 22:53:54.540818"]]

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(user_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "sex" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "ginger"], ["name", "evans2"], ["sex", "M"], ["updated_at", "2019-11-22 23:11:58.762941"], ["id", 3]]